"use strict";


//Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

/*

//НЕ РАБОТАЕТ!!!

const a = 0.1;
const b = 0.2;
let c = (a + b);
//с = 10; - почему это присвоение не работает?
// const c1 = с.toFixed(2); - и так не работате

*/

//Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

/*

РАБОТАЕТ!

let d = '1';
let e = 2;
let f = +d + e; 

*/

//Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

/*

РАБОТАЕТ!

const j = Number(prompt('Please specify the size of flash-drive in GB', ''));
alert(`Your flash drive can contain ${Math.floor(j * 1000 / 820)} files (820Mb each)`);

*/
